Revit 2018 API
IndexStreamTriangle Class
 A stream that can be used to write triangle primitives into a buffer (see Autodesk::Revit::DB::DirectContext3D::IndexBuffer).
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2017
Syntax
C#
public class IndexStreamTriangle : IndexStream
Visual Basic
Public Class IndexStreamTriangle _
	Inherits IndexStream
Visual C++
public ref class IndexStreamTriangle : public IndexStream
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.IndexStream
 Autodesk.Revit.DB.DirectContext3D.IndexStreamTriangle
See Also
IndexStreamTriangle Members
Autodesk.Revit.DB.DirectContext3D Namespace